In [2]:
import pandas as pd
from datasets import load_dataset
import matplotlib as plt

#load data from web
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

#data cleanup
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

In [18]:
hour_med = df['salary_hour_avg'].median()
year_med = df['salary_year_avg'].median()
print(hour_med, year_med)

45.97999954223633 115000.0

In [22]:
df_filled = df

df_filled['salary_year_avg'] = df_filled['salary_year_avg'].fillna(year_med)
df_filled['salary_hour_avg'] = df_filled['salary_hour_avg'].fillna(hour_med)

In [26]:
df_filled.loc[:,'salary_year_avg':'salary_hour_avg']

        salary_year_avg  salary_hour_avg
0              115000.0            45.98
1              115000.0            45.98
2              115000.0            45.98
3              115000.0            45.98
4              115000.0            45.98
...                 ...              ...
785736         115000.0            45.98
785737         115000.0            45.98
785738         115000.0            45.98
785739         115000.0            45.98
785740         115000.0            45.98

[785741 rows x 2 columns]

In [35]:
df_unique = df_filled

df_unique = df_unique.drop_duplicates()
print(f" no duplicates {len(df_unique)}, duplicates {len(df_filled)}", len(df_filled)-len(df_unique))

 no duplicates 785640, duplicates 785741 101

In [38]:
df_unique = df_unique.drop_duplicates(subset=['job_title', 'company_name'])
print(f" no duplicates {len(df_unique)}, duplicates {len(df_filled)}", len(df_filled)-len(df_unique))

 no duplicates 508042, duplicates 785741 277699